Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Comment>Трейд Софт</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодКонтрагента</Name>
					<Comment>Уникальный код контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтзывПерсональныхДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО_ПФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО_Действующее</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО_Реестр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьДанныеОБанкротстве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Телефоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидТелефона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыТелефонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНомера</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыТелефонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаПоДолжнику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаПоДолжнику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапретЗвонка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоЗапретаЗвонка</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецЗапретаЗвонка</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодГорода</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Добавочный</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДляПоиска</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФИО</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фамилия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отчество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/СведенияОбИмуществе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СведенияОбИмуществе</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СведенияОбИмуществе</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имущество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Имущество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваИмущества</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СвойстваИмущества</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Контрагенты/Forms/ФормаВнесениеСведенийОбИмуществе/Ext/Form/Module.bsl
#Область События

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Контрагент = Неопределено;
	Если Не Параметры.Свойство("Контрагент", Контрагент) Тогда
	
		УправленияСообщениями.ТекстовоеСообщить(
			"Попытка открыть форму без указания контрагента"
		);
		Закрыть();
	
	КонецЕсли;
	
	НастроитьЗначенияПоУмолчанию();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УбратьВидимостьСтраниц();
	Элементы.ГруппаТранспорт.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)

	ДанныеИмущества = ТекущиеДанныеИмущества();

	ОтветНаВопрос = КодВозвратаДиалога.Да;
	Если Не ВсеЗаполнены(ДанныеИмущества["Таблица"]) Тогда
	
		ОтветНаВопрос = Вопрос(
			"Продолжить запись?",
			РежимДиалогаВопрос.ДаНет,
			60,
			,
			"В записываемых данных, есть пустые значения"
		);
		
		Если ОтветНаВопрос = КодВозвратаДиалога.Таймаут Тогда
		
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Запись отменена";
			Сообщение.Сообщить();
			Возврат;
		
		КонецЕсли;
	
	КонецЕсли;
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
	
		Возврат;
	
	КонецЕсли;
	
	ТекстРезультата = ЗаписатьСведенияПоИмуществу(ДанныеИмущества);
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстРезультата;
	Сообщение.Сообщить();

КонецПроцедуры

&НаКлиенте
Процедура ТипИмуществаПриИзменении(Элемент)

	УбратьВидимостьСтраниц();
	
	ИмяГруппы = "Группа" + ИмяПредопределенныхДанныхТипаИмущества(ТипИмущества);
	Элементы[ИмяГруппы].Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы[ИмяГруппы];

КонецПроцедуры

//&НаКлиенте
//Процедура ОграничитьЗначение(Элемент)

//	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
//	
//	УправлениеДанными.ОграничитьТипыЗначения(
//		ТекущиеДанные.Свойство,
//		Элемент
//	);

//КонецПроцедуры

&НаКлиенте
Процедура УдалитьПустые(Команда)
	
	ИмяТекущихДанных = ИмяПредопределенныхДанныхТипаИмущества(ТипИмущества);
	Имущество = ЭтотОбъект[ИмяТекущихДанных];
	
	Количество = Имущество.Количество();
	ТекущийНомер = Количество - 1;
	Пока ТекущийНомер >= 0 Цикл
	
		Если Не ЗначениеЗаполнено(Имущество[ТекущийНомер].Значение) Тогда
		
			Транспорт.Удалить(ТекущийНомер);
		
		КонецЕсли;
		ТекущийНомер = ТекущийНомер - 1;
	
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяПредопределенныхДанныхТипаИмущества(ТипИмущества)

	Возврат ТипИмущества.ИмяПредопределенныхДанных;

КонецФункции // ()


#КонецОбласти

#Область УправлениеФормой

&НаСервере
Процедура НастроитьЗначенияПоУмолчанию()

	ТипИмущества = ПланыВидовХарактеристик.Имущество.Транспорт;
	
	ЗаполнитьВсеСвойства();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсеСвойства()

	Имущество = ПланыВидовХарактеристик.Имущество;
	ЗаполнитьСвойстваИмущества(Имущество.Транспорт);
	ЗаполнитьСвойстваИмущества(Имущество.Помещения);
	ЗаполнитьСвойстваИмущества(Имущество.ЗемельныеУчастки);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваИмущества(ВидИмущества)

	СвойстваИмущества = ПланыВидовХарактеристик.СвойстваИмущества;
	Поля = СвойстваИмущества.ПоляИмущества(ВидИмущества);
	
	Для каждого Поле Из Поля Цикл
	
		Элемент = ЭтотОбъект[ВидИмущества.ИмяПредопределенныхДанных].Добавить();
		Элемент.Свойство = Поле["Свойство"];
		Элемент.Значение = УправлениеДанными.ЗначениеПоУмолчанию(Поле["Свойство"].ТипЗначения);
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УбратьВидимостьСтраниц()

	Элементы.ГруппаТранспорт.Видимость = Ложь;
	Элементы.ГруппаЗемельныеУчастки.Видимость = Ложь;
	Элементы.ГруппаПомещения.Видимость = Ложь;

КонецПроцедуры


#КонецОбласти

#Область ЗаписьДанных

&НаКлиенте
Функция ТекущиеДанныеИмущества()

	ДанныеИмущества = Новый Структура;
	
	ИмяТекущихДанных = ИмяПредопределенныхДанныхТипаИмущества(ТипИмущества);
	ДанныеИмущества.Вставить("Имя", ИмяТекущихДанных);
	
	Имущество = ПолучитьТекущийЭлемент(ИмяТекущихДанных);
	ДанныеИмущества.Вставить("Имущество", Имущество);
	
	ТекущаяТаблица = ПолучитьЗаполняемуюТаблицу(ИмяТекущихДанных);
	ДанныеИмущества.Вставить("Таблица", ТекущаяТаблица);

	Возврат ДанныеИмущества;

КонецФункции // ()

&НаКлиенте
Функция ПолучитьТекущийЭлемент(ИмяТекущихДанных)

	ТекущееИмущество = ЭтотОбъект["Элемент" + ИмяТекущихДанных];
	
	Если ЗначениеЗаполнено(ТекущееИмущество) Тогда
	
		Возврат ТекущееИмущество;
	
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции // ()

&НаКлиенте
Функция ПолучитьЗаполняемуюТаблицу(ИмяТекущихДанных)

	Возврат ЭтотОбъект[ИмяТекущихДанных];

КонецФункции // ()

&НаКлиенте
Функция ВсеЗаполнены(ТекущаяТаблица)

	Для каждого Элемент Из ТекущаяТаблица Цикл
	
		Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
		
			Возврат Ложь;
		
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Истина;

КонецФункции // ()


&НаСервере
Функция ЗаписатьСведенияПоИмуществу(ДанныеИмущества)

	НачатьТранзакцию();
	
	Попытка
	
		КонтрольИмущества(ДанныеИмущества);
		ЗанесениеДанных(ДанныеИмущества);
	
	Исключение
		ОтменитьТранзакцию();
		Возврат "Запись не удалась: " + ОписаниеОшибки();
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();

	Возврат "Данные внесены";

КонецФункции

&НаСервере
Процедура КонтрольИмущества(ДанныеИмущества)

	Имущество = ДанныеИмущества["Имущество"];
	Если Не ЗначениеЗаполнено(Имущество) Тогда
	
		ДанныеИмущества["Имущество"] = СоздатьНовыйЭлемент(ДанныеИмущества["Имя"]);
	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗанесениеДанных(ДанныеИмущества)

	Записатор = Документы.СведенияОбИмуществе;
	
	ЗаписьСведений = Записатор.Создать();
	
	Данные = Новый Структура;
	Данные.Вставить("Источник", Справочники.ИсточникиСведений.РучнойВвод);
	Данные.Вставить("Имущество", ДанныеИмущества["Имущество"]);
	Данные.Вставить("Сведения", ДанныеИмущества["Таблица"]);
	Попытка
	
		ЗаписьСведений = Записатор.Заполнить(ЗаписьСведений, Данные);
	
	Исключение
		ВызватьИсключение УправленияСообщениями.ПредупреждениеОбПользовательскойОшибке(
			"Не прошла проверка вносимых данных: " + Символы.ПС
			+ ОписаниеОшибки()
		);
	КонецПопытки;

	Попытка
	
		Записатор.Провести(ЗаписьСведений);
	
	Исключение
		ВызватьИсключение УправленияСообщениями.ПредупреждениеОбПользовательскойОшибке(
			"Не удалось внести сведения: " + Символы.ПС
			+ ОписаниеОшибки()
		);
	КонецПопытки;
	
	Имущество = ПланыВидовХарактеристик.Имущество;
	Имущество.ИзменитьНаименование(
		ДанныеИмущества["Имущество"]
	);

КонецПроцедуры

&НаСервере
Функция СоздатьНовыйЭлемент(ИмяТекущихДанных)

	Возврат Справочники[ИмяТекущихДанных].ПолучитьНовый(Контрагент);

КонецФункции // ()

#КонецОбласти
